/**
 * 验证正则
 * validate.js
 */

/* url */
export const url = /^(https?|ftp):\/\/([a-zA-Z0-9.-]+(:[a-zA-Z0-9.&%$-]+)*@)*((25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9][0-9]?)(\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])){3}|([a-zA-Z0-9-]+\.)*[a-zA-Z0-9-]+\.(com|edu|gov|int|mil|net|org|biz|arpa|info|name|pro|aero|coop|museum|[a-zA-Z]{2}))(:[0-9]+)*(\/($|[a-zA-Z0-9.,?'\\+&%$#=~_-]+))*$/

/* 协议头 */
export const external = /^(https?:|mailto:|tel:|file:)/

/* 邮箱地址 */
// eslint-disable-next-line no-useless-escape
export const email = /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/

/* 手机号码 */
export const phone = /^1[34578]\d{9}$/

/* 固定话 */
export const tel = /^(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,8}$/

/* 联系方式(手机或固话) */
export const telePhone = /^((1[34578]\d{9})|((\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,8}))$/

/* IP */
export const ip = /^((2[0-4]\d|25[0-5]|[01]?\d\d?)\.){3}(2[0-4]\d|25[0-5]|[01]?\d\d?)$/

/* QQ */
export const qq = /^[1-9]{4,10}$/

/* 微信 */
export const weChat = /^[a-zA-Z]{1}[-_a-zA-Z0-9]{5,19}$/

/* 身份证号(15位或18位) */
export const IDCard = /(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}[0-9Xx]$)/

/* 数字(整数或浮点) */
export const numeric = /^\d+(\.\d+)?$/
